# InvalidElemsInSelection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..InvalidElemsInSelection Property
BuiltInFailures..::..EditingFailures Class See Also
---
Can't scale elements together.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidElemsInSelection { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidElemsInSelection As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidElemsInSelection {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace